destrudo/CY8C95X0-Arduino/CY8C95X0.cpp
/* Software License:

  Arduino CY8C95X0 library method file
  Copyright (C) 2013  destrudo

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */


#if ARDUINO >= 100
  #include "Arduino.h"
#else
  #include "WProgram.h"
#endif

#include <Wire.h>
#include <stdarg.h>
#include "CY8C95X0.h"
#include "CY8C95X0_BASE.h"

CY8C95X0::CY8C95X0()
{
  Wire.begin();
}

//chip is the rev of the chip (20,40,60) and A is the complete set of A's
// ex: (20,011) for A0 and A1 set on a 20 i/o chip
CY8C95X0::CY8C95X0(uint8_t chip, uint8_t A)
{
  CY8C95X0::begin(chip, A);
}

/* If you want to use the default constructor so that you aren't allocating the class (Intended for non-dynamic setups)
 * after ALL of your begin() functions are called, you'll need to call this.  MAKE SURE that if you want to dump serial
 * data over the UART, that you call Serial.begin() BEFORE this is called. */
 //chip is the rev of the chip (20,40,60) and A is the complete set of A's
// ex: (20,011) for A0 and A1 set on a 20 i/o chip
void CY8C95X0::begin(uint8_t chip, uint8_t A)
{
  address = CY8C95X0_ADDR;
  
  /* Address handling */
  if(A)
  {
	if( A <= 31 ) address |= A; //Supposing you're setting those bits that are below A5, just OR the address with your address
	else address = A; //If you're not, you might as well just set the whole address yourself, and I'll save myself some slight logic.
  }
  
  /* Feel free to comment the next line out, I just prefer having it on */
  resetChip(); //Clear the chip's current config, roll back to defaults.
  
  switch(chip)
  {
    case 20:
      pin_c = 20;
      pwm_c = 4;
      group_c = 3;
      break;
    case 40:
      pin_c = 40;
      pwm_c = 8;
      group_c = 5;
      break;
    case 60:
      pin_c = 60;
      pwm_c = 16;
      group_c = 8;
      break;
  }
  
  /* IF you wanted to use dynamic allocation for the pin states, uncomment these out. */
  // pinstates = new byte[group_c]; //Allocate the state arrays
  // pwmstates = new byte[group_c]; 
  // pwmconf = new pwm_t[pwm_c];
  // drivestates = new drive_t[group_c];
  // intstates = new byte[group_c];
  // invstates = new byte[group_c];
  
  /* Handle all the addresses */
  
  __getConfig(); //Update the current config
}

/***********************************************************/
/* GENERAL FUNCTIONS BEGIN (Internal math and computation) */
/***********************************************************/

/* To make life easier, this function translates a number to a pin
 * the pin argument is /always/ a two member byte array, it will
 * Not function properly, and will probably kill the chip if called
 * with anything else
 * This is really messy
 */
pin_t CY8C95X0::pinTranslate(uint8_t pinIn)
{
  /* We need to compensate for group 2 */
  pin_t pin = {255,255};
  if((pinIn + 1) > pin_c) return pin; //If pin is outside values, exit.

  if(pinIn > 19) pinIn += 4; //Since port 2 only has a nibble, we need to jump ahead after that point
  pin.pin = byte(pinIn % 8); //set pin
  pin.group = byte(pinIn / 8); //set pin group
  return pin;
}

/* This function resets the device to the programmed defaults
 * When the class is first constructed, it runs this, in order
 * to purge any bad settings (Were there any)
 */
void CY8C95X0::resetChip()
{
  //Run command to reset chip
  rawWrite(2, REG_CMD, REG_CMD_RESTORE);
  rawWrite(2, REG_CMD, REG_CMD_RECONF);
}

/* This determines whether or not the port that was entered was valid
 * It is used by the higher level functions
 */
boolean CY8C95X0::validPort(byte port)
{
   if( (port + 1) > group_c) return false;
   return true;
}

/* This is to simply reset the register pointer
 */
void CY8C95X0::resetRegister()
{
  Wire.beginTransmission(address);
  Wire.write((uint8_t)0);
  Wire.endTransmission();
}

/* LOW LEVEL FUNCTIONS BEGIN */
/* rawWrite(int cmds, ...)
 * arguments:
 * -cmds is number of commands to be sent
 * -varable arguments will be written in order
 * ex: rawWrite(2, REG_PORT_SEL, 0x00) would select group port 0
 *
 * This is pretty low level, but if you need to do something I didn't
 * provide, this is how.
 */
void CY8C95X0::rawWrite(int cmds, ...)
{
  resetRegister();
  va_list argList;
  va_start(argList, cmds);
  byte call = 0;
  Wire.beginTransmission(address);
  for(;cmds;cmds--)
  {
    call = (byte)va_arg(argList,int);
    Wire.write((uint8_t)call);
  }
  Wire.endTransmission();
  va_end(argList);
}

/* This function populates all of the controller data (pin modes, pwm modes, intterupt, pwm config) */
void CY8C95X0::__getConfig()
{
  byte tmp = __getPortDirection(1);
  for(int i = 0; i < group_c; i++)
  {
    pindirections[i] = __getPortDirection(i);
    intstates[i] = __getInterruptMask(i);
    pwmstates[i] = __getPortPWM(i);
    drivestates[i] = __getDrive(i);
    invstates[i] = __getInvStates(i);
  }
  for(int i = 0; i < pwm_c; i++)
  {
    pwmconf[i] = __getPWMConfig(i);
  }
}

/* This is a low-level function for handling port selection as detailed in the datasheet */
void CY8C95X0::__portSelect(byte port)
{
  if(!validPort(port)) return; //If the port specified is out of our range, exit
  rawWrite(2,REG_PORT_SEL,port);
}

/* Get the divider value */
byte CY8C95X0::__getDivider()
{
  byte tmp;
  rawWrite(1, REG_PROG_DIV);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}

/* Get output register values */
byte CY8C95X0::__getOutput(uint8_t group)
{
  byte tmp;
  rawWrite(1, REG_GO0 + group);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}

