destrudo/CY8C95X0-Arduino/CY8C95X0.cpp
/* Get input register values */
byte CY8C95X0::__getInput(uint8_t group)
{
  byte tmp;
  rawWrite(1, (0x00 + group));
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}


  /* these are untested */
  /***********************
   * Interrupt functions *
   ***********************/

   
/* Get port interrupts */
byte CY8C95X0::__interrupt(uint8_t group)
{
  __portSelect(group);
  rawWrite(1, REG_INT_STAT_0 + group);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) return Wire.read();
  return 0;
}
/* Get port interrupts for a group */
byte CY8C95X0::_interrupt(uint8_t group)
{
  if(group >= group_c) return 0x00;
  return __interrupt(group);
}
/* The following 3 functions return a boolean which is the
 * interrupt status on a particular pin
 */
boolean CY8C95X0::interrupt(pin_t pin)
{
  boolean tmp = false;
  tmp = __interrupt(pin.group) & (1 << pin.pin);
  return tmp;
}
/* by a group/pin combo */
boolean CY8C95X0::interrupt(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group, pin};
  return (interrupt(tmp));
}
/* by raw pin number */
boolean CY8C95X0::interrupt(uint8_t pin)
{
  return interrupt(pinTranslate(pin));
}
byte CY8C95X0::__getInterruptMask(uint8_t group)
{
  __portSelect(group);
  rawWrite(1, REG_INT_MASK);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) return Wire.read();
  return 0x00;
}
byte CY8C95X0::_getInterruptMask(uint8_t group)
{
  if(group >= group_c) return 0x00;
  return __getInterruptMask(group);
}
boolean CY8C95X0::getInterruptMask(pin_t pin)
{
  byte tmp = __getInterruptMask(pin.group);
  return (tmp & (1 << pin.pin));
//return (__getInterruptMask(pin.group) & (1 << pin.pin));
}
boolean CY8C95X0::getInterruptMask(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group, pin};
  return getInterruptMask(tmp);
}
boolean CY8C95X0::getInterruptMask(uint8_t pin)
{
  return getInterruptMask(pinTranslate(pin));
}


  /*****************************
   * Input Inversion Functions *
   *****************************/

   
/* Get port inversion states */
byte CY8C95X0::__getInvStates(uint8_t group)
{
  byte tmp;
  __portSelect(group);
  rawWrite(1, REG_INVERSION);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}
/* Everybody in this world is just like me. */
/* Get inversion states for a whole group */
byte CY8C95X0::_getInversionGroup(uint8_t group)
{
  if(group >= group_c) return 0x00;
  return __getInvStates(group);
}
boolean CY8C95X0::getInversion(pin_t pin)
{
  boolean tmp = false;
  tmp = __getInvStates(pin.group) & (1 << pin.pin);
  return tmp;
}
boolean CY8C95X0::getInversion(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group,pin};
  return getInversion(tmp);
}
boolean CY8C95X0::getInversion(uint8_t pin)
{
  return getInversion(pinTranslate(pin));
}
/* High level pin invert (Just calls the register alone) */
void CY8C95X0::__invert(uint8_t pins)
{
  rawWrite(2,REG_INVERSION,pins);
}
/* This calls the required port select and __invert, as well as
 * validating the provided group */
void CY8C95X0::_invert(uint8_t group, uint8_t pins)
{
  __portSelect(group);
  __invert(pins);
}
/* This can either set all pins to inverting, turn off inverting,
 * or invert the current inverting 
 * The default is 0x01, All pins to be inverting
 */
void CY8C95X0::invertGroup(uint8_t group, byte mode)
{
  if(mode == 0x00) _invert(group,0x00);
  else if(mode == 0x01) _invert(group,0xFF);
  else
  {
    if(group >= group_c) return; //We can't have someone addressing out of bounds
    invstates[group] ^= 0xFF;
    _invert(group,invstates[group]);
  }
}
/* Set a pin to have inverse input */
/* There are modes allowed only in this function
 * which accepts a pin type.
 * 0 = turn off
 * 1 = Turn on //Default
 * everything else = toggle
 */
void CY8C95X0::invert(pin_t pin, byte mode)
{
  if(pin.group >= group_c) return;
  if(mode == 0x00)
  {
    invstates[pin.group] &= ~(1 << pin.pin);
  }
  else if (mode == 0x01)
  {
    invstates[pin.group] |= 1 << pin.pin;
  }
  else
  {
    invstates[pin.group] ^= 1 << pin.pin;
  }
  _invert(pin.group,invstates[pin.group]);
}
void CY8C95X0::invert(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group,pin};
  invert(tmp);
}
void CY8C95X0::invert(uint8_t pin)
{
  invert(pinTranslate(pin));
}
/*Toggle the inversion on a single pin */
void CY8C95X0::invertT(uint8_t pin)
{
  invert(pinTranslate(pin),0x02);
}
void CY8C95X0::invertT(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group,pin};
  invert(tmp,0x02);
}
/* Turn inversion off for a pin */
void CY8C95X0::invertOff(uint8_t pin)
{
  invert(pinTranslate(pin),0x00);
}
void CY8C95X0::invertOff(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group,pin};
  invert(tmp,0x00);
}


  /*****************
   * PWM functions *
   *****************/
   
   
/* pinPWM(pin_t pin)
 * This method accepts a pin type and returns the pwm controller for said pin.
 * -It does run a sanity check on the pin.group and pin.pin values
 * -At the moment, it only supports a matrix for the 60 pin model, but others
 *  will be added at a later date.
 */
int CY8C95X0::pinPWM(pin_t pin)
{
  if( (pin.group >= group_c) || (pin.pin >= MAX_PIN) ) return;

  /* 60 pin pwm matrix
       P0   P1   P2   P3   P4   P5   P6   P7
  G0   7    5    3    1    7    5    3    1
  G1   6    4    2    0    6    4    2    0    
  G2   14   12   8    11
  G3   7    5    3    1    15   13   11   9
  G4   6    4    2    0    14   12   10   8
  G5   10   8    11   9    12   14   13   15
  G6   0    1    2    3    4    5    6    7
  G7   8    9    10   11   12   13   14   15
  */
  byte level[8][8] = { {7,5,4,1,7,5,3,1},
                       {6,4,2,0,6,4,2,0},
                       {14,12,8,11,255,255,255,255}, 
                       {7,5,3,1,15,13,11,9},
                       {6,4,2,0,14,12,10,8},
                       {10,8,11,9,12,14,13,15},
                       {0,1,2,3,4,5,6,7},
                       {8,9,10,11,12,13,14,15} };
  return level[pin.group][pin.pin];
}
/* __getPWMConfig(uint8_t circuit)
 * This method returns a pwm_t struct containing circuit pwm's settings
 * -There is no software sanity check, however the hardware will likely not
 * return sensible data if a circuit is used greater than the pwm_c variable
 */
pwm_t CY8C95X0::__getPWMConfig(uint8_t circuit)
{
  pwm_t tmp;
  rawWrite(2, REG_SEL_PWM, circuit);
  Wire.requestFrom(address, uint8_t(3));
  if(Wire.available()) tmp.clock = Wire.read();
  if(Wire.available()) tmp.period = Wire.read();
  if(Wire.available()) tmp.pw = Wire.read();
  return tmp;
}
/* __getPortPWM(uint8_t group)
 * This method returns a byte containing the currents pins with PWM enabled
 * (The 1's) and the disabled (0's) pins within a given group. 
 * -There are no sanity checks, but the hardware will react poorly to a group
 * getting selected that is greater than group_c
 */
byte CY8C95X0::__getPortPWM(uint8_t group)
{
  byte tmp;
  __portSelect(group);
  rawWrite(1, REG_SEL_PWM_PORT_OUT);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}
/* __pwmSelect(byte pins)
 * This method does a simple write of the PWM Select command followed by a pin
 * byte.
 * -There is no sanity check
 * -It does not call the port open, initiating this command alone will do nothing
 * that anyone expects.
 */
void CY8C95X0::__pwmSelect(byte pins)
{
  rawWrite(2,REG_SEL_PWM_PORT_OUT,pins); //Send the command
}
/* __pwmConfigSelect(byte controller)
 * This method is used to initiate a command write to the (controller) pwm
 * controller for purposes of changing settings.
 * -There is no sanity check, running this will result in the hardware waiting
 * for further data (Hanging until another set of bytes comes along)
 */
void CY8C95X0::__pwmConfigSelect(byte controller)
{
  rawWrite(2,REG_SEL_PWM,controller);
}
/* __pwmClockSel(byte pwmController)
 * This method is for initiating reading, or writing clock data from/to the 
 * pwm (controller) set
 * -There is no sanity check, the hardware will bug out if this is used without
 * proper commands sent.
 */
void CY8C95X0::__pwmClockSel(byte pwmController)
{
  rawWrite(2,REG_CONF_PWM,pwmController);
}
/* PWM Period setting register */
void CY8C95X0::__pwmConfigPeriod(byte period)
{
  rawWrite(2,REG_PERI_PWM,period);
}
/* PWM Pulse Width setting register */
void CY8C95X0::__pwmConfigPulseWidth(byte pulsewidth)
{
  rawWrite(2,REG_PW_PWM,pulsewidth);
}
/* Programmable divider setting
 * Using this without understanding is a bad idea, it can mess with things in a bad way.
 * Its intent is for using the 00000100b setting on the pwm config to achieve custom frequencies
 * on the controller.  Problem is, it applies to all controllers.  So setting it will mess with
 * the other pwms.
 *
 * Here in the case that someone wants to use the programmable clock for some much-more-accurate
 * frequencies.
 *
 * I include no sanity check, you get to do that.
 */
void CY8C95X0::__pwmConfigDivider(byte divider)
{
  rawWrite(2,REG_PROG_DIV,divider);
}
/* This is the non-complex pwm config function.
 * The period is a completely optional argument
 * since so few people will realistically need
 * a higher frequency than 130hz.  But incase
 * You need some math pointers,
 * 1khz = 0x22 to the register
 * 142hz = 0xF0, 2khz = 0x11, 435hz = 0x4F
 */
void CY8C95X0::_pwmConfig(byte circuit, byte pw, byte period)
{
  pwm_t tmp = pwmconf[circuit]; //Copy the current config

