destrudo/CY8C95X0-Arduino/CY8C95X0.cpp
  if(period != 0xFF) //If period is set
  {
    tmp.period = period; //Copy our period
  }
  else //If period was not set, copy the old data
  {
    tmp.period = pwmconf[circuit].period;
  }
  tmp.pw = pw;
  pwmconf[circuit] = tmp; //Save the config
  __pwmConfigSelect(circuit); //Write it to the chip
  __pwmConfigPeriod(pwmconf[circuit].period);
  __pwmConfigSelect(circuit);
  __pwmConfigPulseWidth(pwmconf[circuit].pw);
}
/* This is the complex pwm config function.
 * This accepts a clock source, a period, a pulse width, and a circuit.
 * There's no default anything here, they must all be set
 * Read the data sheet if you intend to use this, otherwise you'll regret
 * it just as I have.
 */
void CY8C95X0::_pwmConfig(byte circuit, byte clock, byte period, byte pw)
{
  pwm_t tmp = {clock, period, pw};
  pwmconf[circuit] = tmp;
  __pwmConfigSelect(circuit);
  __pwmClockSel(clock);
  __pwmConfigSelect(circuit);
  __pwmConfigPeriod(period);
  __pwmConfigSelect(circuit);
  __pwmConfigPulseWidth(pw);
}
void CY8C95X0::_pwmSelect(pin_t pin, boolean mode)
{
  if(mode == HIGH)
  {
    pwmstates[pin.group] |= 1 << pin.pin;  //Set the PWM state local 'register'
	pinstates[pin.group] |= 1 << pin.pin;  //Set the pinstates local 'register' so that if another digitalWrite occurs, our pwm isn't reset.
  }
  else
  {
    pwmstates[pin.group] &= ~(1 << pin.pin);
	pinstates[pin.group] &= ~(1 << pin.pin);
  }
  __portSelect(pin.group);
  __pwmSelect(pwmstates[pin.group]);
}
/* Modify everything */
void CY8C95X0::pwmConfig(byte circuit, byte clock, byte period, byte pw)
{
  //Sanity check the values
  if(circuit >= pwm_c) return;
  if(pw >= period) return;
  _pwmConfig(circuit, clock, period, pw);
}
/* Modify duty cycle only */
void CY8C95X0::pwmConfig(byte circuit, byte duty)
{
  if(circuit >= pwm_c) return; //If the circuit requested is higher than that on our chip, exit.
  if(duty >= pwmconf[circuit].period) return; //Pulse width, according to the datasheet, should always be less than the period by at least 1
  _pwmConfig(circuit, duty);
}
/* turn pwm on or off on a single pin */
void CY8C95X0::pwmSelect(uint8_t pinIn, boolean mode)
{
  pin_t pin_v = pinTranslate(pinIn);
  _pwmSelect(pin_v, mode);
}
/* Turn pwm on or off for a single pin */
void CY8C95X0::pwmSelect(uint8_t group, uint8_t pinIn, boolean mode)
{
  pin_t pinOut = {group,pinIn};
  _pwmSelect(pinOut, mode);
}
/* Sets all pins pwm mode on or off */
void CY8C95X0::pwmSelect(boolean mode)
{
  for(int i = 0; i < group_c; i++)
  {
    __portSelect(i);
    if(mode == HIGH) __pwmSelect(ALL_PINS);
    else __pwmSelect(NO_PINS);
  }
}
/* Same as analogWrite */
void CY8C95X0::analogWrite(pin_t pin, uint8_t value)
{
  _pwmConfig(pinPWM(pin),value);
}
void CY8C95X0::analogWrite(byte group, byte pin, uint8_t value)
{
  pin_t tmp = {group, pin};
  _pwmConfig(pinPWM(tmp), value);
}
void CY8C95X0::analogWrite(uint8_t pin, uint8_t value)
{
  _pwmConfig(pinPWM(pinTranslate(pin)),value);
}


  /************************
   * Drive mode functions *
   ************************/

   
/* get drive states for a group */
drive_t CY8C95X0::__getDrive(uint8_t group)
{
  drive_t tmp;
  __portSelect(group);
  rawWrite(1, REG_DM_PU);
  Wire.requestFrom(address, uint8_t(7));
  if(Wire.available()) tmp.pullup = Wire.read();
  if(Wire.available()) tmp.pulldown = Wire.read();
  if(Wire.available()) tmp.odhigh = Wire.read();
  if(Wire.available()) tmp.odlow = Wire.read();
  if(Wire.available()) tmp.strong = Wire.read();
  if(Wire.available()) tmp.slow = Wire.read();
  if(Wire.available()) tmp.hiz = Wire.read();
  return tmp;
}

/* This is a low-level function for handling pin driving modes across a whole group
 */
//void CY8C95X0::__driveSelect(byte pins, byte mode)
void CY8C95X0::__driveSelect(byte pins, byte mode)
{
  rawWrite(2,mode,pins);
}

/* Handles a drive select on a single pin */
/* We should really make it so that mode is the actual Register
 * so that we don't waste more space with the case scenarios
 */
void CY8C95X0::_driveSelectPin(pin_t pin, byte mode)
{
  if( (mode <= REG_DM_PU) && (mode >= REG_DM_HIZ) ) return; //If the mode handed to us is out of range, return without doing anything.
  byte tmp;
  if(mode == REG_DM_PU) tmp = drivestates[pin.group].pullup;
  else if(mode == REG_DM_PD) tmp = drivestates[pin.group].pulldown;
  else if(mode == REG_DM_ODH) tmp = drivestates[pin.group].odhigh;
  else if(mode == REG_DM_ODL) tmp = drivestates[pin.group].odlow;
  else if(mode == REG_DM_STRONG) tmp = drivestates[pin.group].strong;
  else if(mode == REG_DM_SLOW) tmp = drivestates[pin.group].slow;
  else tmp = drivestates[pin.group].hiz;
  //Modify the single pin
  tmp |= 1 << pin.pin;
  
  /* I don't like the next statement, but it doesn't seem to me that
   * anyone would want to constantly change drive modes.  If I'm wrong,
   * the math isn't that hard to switch out so that we have local state
   * math done, rather than hitting up the i2c bus.
   */
  drivestates[pin.group] = __getDrive(pin.group); //Re-read the groups drive states
  //Call the port
  __portSelect(pin.group);
  //Call __driveSelect
  __driveSelect(tmp,mode);
}

/* This sets the drive mode, something very important if you're doing PWM
 * mode can be:
 * 0: Resistive pullup
 * 1: Resistive pulldown
 * 2: High open drain
 * 3: low open drain
 * 4: strong drive
 * 5: strong and slow drive
 * 6: High impedance
 * Arguments are <Bus (0-7)>, <Pin (0-7)> and 
 */
void CY8C95X0::driveSelectAll(byte mode)
{
  for(int i=0; i < group_c; i++)
  {
    __portSelect(i);
    __driveSelect(0xFF,mode);
  }
}

/* Handles drive selection setting for a whole group at once */
void CY8C95X0::driveSelectGroup(uint8_t port, byte mode)
{
  //call port group
  __portSelect(port);
  __driveSelect(0xFF,mode);
}

/* Changes driving mode for a single pin */
void CY8C95X0::driveMode(uint8_t pin, byte mode)
{
  _driveSelectPin(pinTranslate(pin),mode);
}


  /***************************
   * Pin direction functions *
   ***************************/


