destrudo/CY8C95X0-Arduino/CY8C95X0.cpp
/* Get port input/output mode */
byte CY8C95X0::__getPortDirection(uint8_t group)
{
  byte tmp = 0;
  __portSelect(group);
  rawWrite(1, REG_PIN_DIR);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  return tmp;
}
void CY8C95X0::__pinDirection(byte pins)
{
  rawWrite(2,REG_PIN_DIR,pins);
}
/* Sets pins as inputs or outputs, accepts a pin type */
void CY8C95X0::_pinMode(pin_t pin, boolean mode)
{
  if(mode == INPUT) pinstates[pin.group] |= (1 << pin.pin); //If high, set the bit
  else pinstates[pin.group] &= ~(1 << pin.pin); //If low, clear the bit
  __portSelect(pin.group); //Call the port
  __pinDirection(pinstates[pin.group]); //Set the data
}
//Set pin as input or output the same as arduino
void CY8C95X0::pinMode(uint8_t pinIn, boolean mode)
{
  _pinMode(pinTranslate(pinIn), mode);
}
void CY8C95X0::pinMode(byte groupIn, byte pinIn, boolean mode)
{
  pin_t pin = {groupIn,pinIn};
  _pinMode(pin, mode);
}


  /*****************
   * I/O Functions *
   *****************/


/* Digital Handler
 * Writes two bytes, where the first is the command (Starting point register) and the second is the
 * byte of pin status to be set
 */
void CY8C95X0::__digitalH(byte command, byte pins)
{
  rawWrite(2,command,pins);
}

/* lower level digital read */
boolean CY8C95X0::_digitalRead(pin_t pin)
{
  byte tmp;
  rawWrite(1, REG_GI0 + pin.group);
  Wire.requestFrom(address, uint8_t(1));
  if(Wire.available()) tmp = Wire.read();
  if((tmp & (1 << pin.pin)) >= 1) return HIGH;
  else return LOW;
}

//Exactly like the arduino method
boolean CY8C95X0::digitalRead(uint8_t pin)
{
  return _digitalRead(pinTranslate(pin));
}

/* Almost like the arduino method, just easier for this chip, because the
 * datasheet doesn't relate port numbers the same way.
 */
boolean CY8C95X0::digitalRead(uint8_t group, uint8_t pin)
{
  pin_t tmp = {group, pin};
  return _digitalRead(tmp);
}

/* This low-level call enables or disables a particular pin */
/* pin_t in this function is used to specify a /particular/ pin, not all of the pins */
void CY8C95X0::_digitalWrite(pin_t pin, boolean mode)
{
  if(mode == HIGH) pinstates[pin.group] |= 1 << pin.pin; //If high, set the bit
  if(mode == LOW) pinstates[pin.group] &= ~(1 << pin.pin); //If low, clear the bit
  __digitalH((REG_GO0 + pin.group),pinstates[pin.group]); //Digitalwrite doesn't need to select any port, just directly write away.
}
/* This works quite the same way as digitalwrite */
void CY8C95X0::digitalWrite(uint8_t pinIn, boolean mode)
{
  _digitalWrite(pinTranslate(pinIn),mode);
}
//In case you want to set it the more datasheet translatable way
void CY8C95X0::digitalWrite(byte groupIn, byte pinIn, boolean mode)
{
  pin_t pin_v = {groupIn,pinIn};
  _digitalWrite(pin_v,mode);
}    
//This is for writing to every pin on the chip
void CY8C95X0::digitalWrite(boolean mode)
{
  //There is a faster way to do this, but for now, just iterate writes.
  for(int i = 0; i < group_c; i++)
  {
    if(mode == HIGH) __digitalH(i,ALL_PINS);
    else __digitalH(i,NO_PINS);
  }
  
}